---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarReinforcementData
source: html/888a586f-203f-9b9a-3a8e-660db216239e.htm
---
# RebarReinforcementData Methods

Creates a new instance of RebarReinforcementData, or Nothing nullptr a null reference ( Nothing in Visual Basic) if the operation fails.